[Killed] ArithmeticOperator
src/game/state.ts:24:31
 export type Direction = 'left' | 'right' | 'none';
 
 export function createInitialState(): GameState {
-  const player = createPlayer(GAME_WIDTH / 2 - 25, 550);
+  const player = createPlayer(GAME_WIDTH * 2 - 25, 550);
   const aliens = createAlienGrid();
   const shields = [
killedBy: update should move player right when right action is active
statusReason: expected 750 to be greater than 1575

[Survived] ArithmeticOperator
src/game/state.ts:24:31
 export type Direction = 'left' | 'right' | 'none';
 
 export function createInitialState(): GameState {
-  const player = createPlayer(GAME_WIDTH / 2 - 25, 550);
+  const player = createPlayer(GAME_WIDTH / 2 + 25, 550);
   const aliens = createAlienGrid();
   const shields = [

[Killed] BooleanLiteral
src/game/state.ts:39:15
     bullets: [],
     shields,
     score: 0,
-    gameOver: false,
+    gameOver: true,
     won: false,
     alienDirection: 1,
killedBy: update should move player left when left action is active
statusReason: expected 375 to be less than 375

[Killed] BooleanLiteral
src/game/state.ts:40:10
     shields,
     score: 0,
     gameOver: false,
-    won: false,
+    won: true,
     alienDirection: 1,
   };
killedBy: update should move player left when left action is active
statusReason: expected 375 to be less than 375

[Killed] UpdateOperator
src/game/state.ts:55:40
     { type: 'bottom', points: 10 },
   ];
 
-  for (let row = 0; row < rows.length; row++) {
+  for (let row = 0; row < rows.length; row--) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
killedBy: update should move player left when left action is active
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/game/state.ts:55:21
     { type: 'bottom', points: 10 },
   ];
 
-  for (let row = 0; row < rows.length; row++) {
+  for (let row = 0; false; row++) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ConditionalExpression
src/game/state.ts:56:23
   ];
 
   for (let row = 0; row < rows.length; row++) {
-    for (let col = 0; col < 11; col++) {
+    for (let col = 0; false; col++) {
       const x = 80 + col * 55;
       const y = 60 + row * 45;
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] EqualityOperator
src/game/state.ts:56:23
   ];
 
   for (let row = 0; row < rows.length; row++) {
-    for (let col = 0; col < 11; col++) {
+    for (let col = 0; col <= 11; col++) {
       const x = 80 + col * 55;
       const y = 60 + row * 45;
killedBy: createInitialState should create a grid of aliens (5 rows x 11 cols)
statusReason: expected [ …(60) ] to have a length of 55 but got 60

[Survived] ArithmeticOperator
src/game/state.ts:57:17
 
   for (let row = 0; row < rows.length; row++) {
     for (let col = 0; col < 11; col++) {
-      const x = 80 + col * 55;
+      const x = 80 - col * 55;
       const y = 60 + row * 45;
       aliens.push(createAlien(x, y, rows[row].type, rows[row].points));

[Survived] ArithmeticOperator
src/game/state.ts:57:22
 
   for (let row = 0; row < rows.length; row++) {
     for (let col = 0; col < 11; col++) {
-      const x = 80 + col * 55;
+      const x = 80 + col / 55;
       const y = 60 + row * 45;
       aliens.push(createAlien(x, y, rows[row].type, rows[row].points));

[Survived] ArithmeticOperator
src/game/state.ts:58:22
   for (let row = 0; row < rows.length; row++) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
-      const y = 60 + row * 45;
+      const y = 60 + row / 45;
       aliens.push(createAlien(x, y, rows[row].type, rows[row].points));
     }

[Survived] ArithmeticOperator
src/game/state.ts:58:17
   for (let row = 0; row < rows.length; row++) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
-      const y = 60 + row * 45;
+      const y = 60 - row * 45;
       aliens.push(createAlien(x, y, rows[row].type, rows[row].points));
     }

[Killed] ConditionalExpression
src/game/state.ts:66:7
 }
 
 export function movePlayer(state: GameState, direction: Direction, dt: number): GameState {
-  if (direction === 'none') return state;
+  if (true) return state;
 
   const dir = direction === 'left' ? -1 : 1;
killedBy: update should move player left when left action is active
statusReason: expected 375 to be less than 375

[Killed] ConditionalExpression
src/game/state.ts:66:7
 }
 
 export function movePlayer(state: GameState, direction: Direction, dt: number): GameState {
-  if (direction === 'none') return state;
+  if (false) return state;
 
   const dir = direction === 'left' ? -1 : 1;
killedBy: movePlayer should not move when direction is none
statusReason: expected 380 to be 375 // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:68:15
 export function movePlayer(state: GameState, direction: Direction, dt: number): GameState {
   if (direction === 'none') return state;
 
-  const dir = direction === 'left' ? -1 : 1;
+  const dir = false ? -1 : 1;
   let newX = state.player.x + dir * PLAYER_SPEED * dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
killedBy: update should move player left when left action is active
statusReason: expected 380 to be less than 375

[Killed] ConditionalExpression
src/game/state.ts:68:15
 export function movePlayer(state: GameState, direction: Direction, dt: number): GameState {
   if (direction === 'none') return state;
 
-  const dir = direction === 'left' ? -1 : 1;
+  const dir = true ? -1 : 1;
   let newX = state.player.x + dir * PLAYER_SPEED * dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
killedBy: update should move player right when right action is active
statusReason: expected 370 to be greater than 375

[Killed] ArithmeticOperator
src/game/state.ts:69:14
   if (direction === 'none') return state;
 
   const dir = direction === 'left' ? -1 : 1;
-  let newX = state.player.x + dir * PLAYER_SPEED * dt;
+  let newX = state.player.x - dir * PLAYER_SPEED * dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
 
killedBy: update should move player left when left action is active
statusReason: expected 380 to be less than 375

[Survived] ArithmeticOperator
src/game/state.ts:69:31
   if (direction === 'none') return state;
 
   const dir = direction === 'left' ? -1 : 1;
-  let newX = state.player.x + dir * PLAYER_SPEED * dt;
+  let newX = state.player.x + dir / PLAYER_SPEED * dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
 

[Killed] MethodExpression
src/game/state.ts:70:10
 
   const dir = direction === 'left' ? -1 : 1;
   let newX = state.player.x + dir * PLAYER_SPEED * dt;
-  newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
+  newX = Math.min(0, Math.min(GAME_WIDTH - state.player.width, newX));
 
   return { ...state, player: { ...state.player, x: newX } };
killedBy: update should move player right when right action is active
statusReason: expected 0 to be greater than 375

[Killed] MethodExpression
src/game/state.ts:70:22
 
   const dir = direction === 'left' ? -1 : 1;
   let newX = state.player.x + dir * PLAYER_SPEED * dt;
-  newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
+  newX = Math.max(0, Math.max(GAME_WIDTH - state.player.width, newX));
 
   return { ...state, player: { ...state.player, x: newX } };
killedBy: update should move player left when left action is active
statusReason: expected 750 to be less than 375

[Killed] MethodExpression
src/game/state.ts:76:27
 }
 
 export function playerShoot(state: GameState): GameState {
-  const hasPlayerBullet = state.bullets.some(b => b.owner === 'player');
+  const hasPlayerBullet = state.bullets.every(b => b.owner === 'player');
   if (hasPlayerBullet) return state;
 
killedBy: playerShoot should create a bullet at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/game/state.ts:76:51
 }
 
 export function playerShoot(state: GameState): GameState {
-  const hasPlayerBullet = state.bullets.some(b => b.owner === 'player');
+  const hasPlayerBullet = state.bullets.some(b => b.owner !== 'player');
   if (hasPlayerBullet) return state;
 
killedBy: playerShoot should not shoot if player bullet already exists
statusReason: expected [ { x: 398.5, y: 550, …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/game/state.ts:77:7
 
 export function playerShoot(state: GameState): GameState {
   const hasPlayerBullet = state.bullets.some(b => b.owner === 'player');
-  if (hasPlayerBullet) return state;
+  if (false) return state;
 
   const bullet = createBullet(
killedBy: playerShoot should not shoot if player bullet already exists
statusReason: expected [ { x: 398.5, y: 550, …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/game/state.ts:77:7
 
 export function playerShoot(state: GameState): GameState {
   const hasPlayerBullet = state.bullets.some(b => b.owner === 'player');
-  if (hasPlayerBullet) return state;
+  if (true) return state;
 
   const bullet = createBullet(
killedBy: playerShoot should create a bullet at player position
statusReason: expected [] to have a length of 1 but got +0

[Survived] ArithmeticOperator
src/game/state.ts:80:5
   if (hasPlayerBullet) return state;
 
   const bullet = createBullet(
-    state.player.x + state.player.width / 2 - 1.5,
+    state.player.x + state.player.width / 2 + 1.5,
     state.player.y,
     'player',

[Survived] ArithmeticOperator
src/game/state.ts:80:5
   if (hasPlayerBullet) return state;
 
   const bullet = createBullet(
-    state.player.x + state.player.width / 2 - 1.5,
+    state.player.x - state.player.width / 2 - 1.5,
     state.player.y,
     'player',

[Killed] ArrayDeclaration
src/game/state.ts:84:31
     state.player.y,
     'player',
   );
-  return { ...state, bullets: [...state.bullets, bullet] };
+  return { ...state, bullets: [] };
 }
 
killedBy: playerShoot should create a bullet at player position
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/game/state.ts:88:42
 }
 
 export function moveAliens(state: GameState, dt: number): GameState {
-  const liveAliens = state.aliens.filter(a => a.alive);
+  const liveAliens = state.aliens.filter(() => undefined);
   if (liveAliens.length === 0) return state;
 
killedBy: moveAliens should move aliens horizontally
statusReason: expected 80 not to be 80 // Object.is equality

[Killed] MethodExpression
src/game/state.ts:88:22
 }
 
 export function moveAliens(state: GameState, dt: number): GameState {
-  const liveAliens = state.aliens.filter(a => a.alive);
+  const liveAliens = state.aliens;
   if (liveAliens.length === 0) return state;
 
killedBy: moveAliens should do nothing when all aliens are dead
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:89:7
 
 export function moveAliens(state: GameState, dt: number): GameState {
   const liveAliens = state.aliens.filter(a => a.alive);
-  if (liveAliens.length === 0) return state;
+  if (false) return state;
 
   const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 2;
killedBy: moveAliens should do nothing when all aliens are dead
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:89:7
 
 export function moveAliens(state: GameState, dt: number): GameState {
   const liveAliens = state.aliens.filter(a => a.alive);
-  if (liveAliens.length === 0) return state;
+  if (true) return state;
 
   const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 2;
killedBy: moveAliens should move aliens horizontally
statusReason: expected 80 not to be 80 // Object.is equality

[Survived] ArithmeticOperator
src/game/state.ts:91:17
   const liveAliens = state.aliens.filter(a => a.alive);
   if (liveAliens.length === 0) return state;
 
-  const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 2;
+  const speed = ALIEN_SPEED_BASE - (55 - liveAliens.length) * 2;
   let direction = state.alienDirection;
 

[Survived] ArithmeticOperator
src/game/state.ts:91:37
   const liveAliens = state.aliens.filter(a => a.alive);
   if (liveAliens.length === 0) return state;
 
-  const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 2;
+  const speed = ALIEN_SPEED_BASE + (55 + liveAliens.length) * 2;
   let direction = state.alienDirection;
 

[Killed] BlockStatement
src/game/state.ts:95:41
   let direction = state.alienDirection;
 
   // Check if any alive alien hits the edge
-  const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
-    return a.x - speed * dt <= 0;
-  });
+  const hitsEdge = liveAliens.some(a => {});
 
   if (hitsEdge) {
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Survived] MethodExpression
src/game/state.ts:95:20
   let direction = state.alienDirection;
 
   // Check if any alive alien hits the edge
-  const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
-    return a.x - speed * dt <= 0;
-  });
+  const hitsEdge = liveAliens.every(a => {
+  if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
+  return a.x - speed * dt <= 0;
+});
 
   if (hitsEdge) {

[Killed] ConditionalExpression
src/game/state.ts:96:33
 
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
+    if (direction === 1) return false;
     return a.x - speed * dt <= 0;
   });
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/game/state.ts:96:33
 
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
+    if (direction === 1) return a.x + a.width - speed * dt >= GAME_WIDTH;
     return a.x - speed * dt <= 0;
   });
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/game/state.ts:97:12
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
     if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
-    return a.x - speed * dt <= 0;
+    return a.x + speed * dt <= 0;
   });
 
killedBy: moveAliens should reverse direction at left edge
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:97:12
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
     if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
-    return a.x - speed * dt <= 0;
+    return false;
   });
 
killedBy: moveAliens should reverse direction at left edge
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:100:7
     return a.x - speed * dt <= 0;
   });
 
-  if (hitsEdge) {
+  if (false) {
     // Step down and reverse
     const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Killed] BlockStatement
src/game/state.ts:100:17
     return a.x - speed * dt <= 0;
   });
 
-  if (hitsEdge) {
-    // Step down and reverse
-    const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
-    const newDirection = direction === 1 ? -1 : 1;
-    return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
-  }
+  if (hitsEdge) {}
 
   const dx = direction * speed * dt;
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/game/state.ts:102:57
 
   if (hitsEdge) {
     // Step down and reverse
-    const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
+    const newAliens = state.aliens.map(a => ({ ...a, y: a.y - ALIEN_STEP_DOWN }));
     const newDirection = direction === 1 ? -1 : 1;
     return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 40 to be greater than 60

[Killed] ConditionalExpression
src/game/state.ts:103:26
   if (hitsEdge) {
     // Step down and reverse
     const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
-    const newDirection = direction === 1 ? -1 : 1;
+    const newDirection = false ? -1 : 1;
     return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
   }
killedBy: moveAliens should reverse direction and step down at edge
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ConditionalExpression
src/game/state.ts:103:26
   if (hitsEdge) {
     // Step down and reverse
     const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
-    const newDirection = direction === 1 ? -1 : 1;
+    const newDirection = true ? -1 : 1;
     return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
   }
killedBy: moveAliens should reverse direction at left edge
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/game/state.ts:107:14
     return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
   }
 
-  const dx = direction * speed * dt;
+  const dx = direction * speed / dt;
   const newAliens = state.aliens.map(a => ({ ...a, x: a.x + dx }));
   return { ...state, aliens: newAliens };
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Survived] ArithmeticOperator
src/game/state.ts:107:14
     return { ...state, aliens: newAliens, alienDirection: newDirection as 1 | -1 };
   }
 
-  const dx = direction * speed * dt;
+  const dx = direction / speed * dt;
   const newAliens = state.aliens.map(a => ({ ...a, x: a.x + dx }));
   return { ...state, aliens: newAliens };

[Survived] ArithmeticOperator
src/game/state.ts:108:55
   }
 
   const dx = direction * speed * dt;
-  const newAliens = state.aliens.map(a => ({ ...a, x: a.x + dx }));
+  const newAliens = state.aliens.map(a => ({ ...a, x: a.x - dx }));
   return { ...state, aliens: newAliens };
 }

[Killed] MethodExpression
src/game/state.ts:113:22
 }
 
 export function moveBullets(state: GameState, dt: number): GameState {
-  const newBullets = state.bullets
-    .map(b => ({ ...b, y: b.y + b.vy * dt }))
-    .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
+  const newBullets = state.bullets.map(b => ({
+  ...b,
+  y: b.y + b.vy * dt
+}));
   return { ...state, bullets: newBullets };
 }
killedBy: moveBullets should remove bullets that leave the screen top
statusReason: expected [ { x: 398.5, …(5) } ] to have a length of +0 but got 1

[Killed] ArithmeticOperator
src/game/state.ts:114:27
 
 export function moveBullets(state: GameState, dt: number): GameState {
   const newBullets = state.bullets
-    .map(b => ({ ...b, y: b.y + b.vy * dt }))
+    .map(b => ({ ...b, y: b.y - b.vy * dt }))
     .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
   return { ...state, bullets: newBullets };
killedBy: update should move bullets each tick
statusReason: expected 563.3333333333333 to be less than 556.6666666666666

[Killed] ArithmeticOperator
src/game/state.ts:114:33
 
 export function moveBullets(state: GameState, dt: number): GameState {
   const newBullets = state.bullets
-    .map(b => ({ ...b, y: b.y + b.vy * dt }))
+    .map(b => ({ ...b, y: b.y + b.vy / dt }))
     .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
   return { ...state, bullets: newBullets };
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/game/state.ts:115:18
 export function moveBullets(state: GameState, dt: number): GameState {
   const newBullets = state.bullets
     .map(b => ({ ...b, y: b.y + b.vy * dt }))
-    .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
+    .filter(b => b.y + b.height > 0 || b.y < GAME_HEIGHT);
   return { ...state, bullets: newBullets };
 }
killedBy: moveBullets should remove bullets that leave the screen top
statusReason: expected [ { x: 398.5, …(5) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/game/state.ts:115:40
 export function moveBullets(state: GameState, dt: number): GameState {
   const newBullets = state.bullets
     .map(b => ({ ...b, y: b.y + b.vy * dt }))
-    .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
+    .filter(b => b.y + b.height > 0 && b.y >= GAME_HEIGHT);
   return { ...state, bullets: newBullets };
 }
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/game/state.ts:120:22
 }
 
 export function aliensShoot(state: GameState): GameState {
-  const liveAliens = state.aliens.filter(a => a.alive);
+  const liveAliens = state.aliens;
   if (liveAliens.length === 0) return state;
 
killedBy: aliensShoot should not shoot if no aliens alive
statusReason: expected [ { x: 540, y: 90, width: 3, …(3) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
src/game/state.ts:120:42
 }
 
 export function aliensShoot(state: GameState): GameState {
-  const liveAliens = state.aliens.filter(a => a.alive);
+  const liveAliens = state.aliens.filter(() => undefined);
   if (liveAliens.length === 0) return state;
 
killedBy: aliensShoot should add an alien bullet
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/game/state.ts:121:7
 
 export function aliensShoot(state: GameState): GameState {
   const liveAliens = state.aliens.filter(a => a.alive);
-  if (liveAliens.length === 0) return state;
+  if (liveAliens.length !== 0) return state;
 
   const shooter = liveAliens[Math.floor(Math.random() * liveAliens.length)];
killedBy: aliensShoot should add an alien bullet
statusReason: expected [] to have a length of 1 but got +0

[Survived] ArithmeticOperator
src/game/state.ts:123:41
   const liveAliens = state.aliens.filter(a => a.alive);
   if (liveAliens.length === 0) return state;
 
-  const shooter = liveAliens[Math.floor(Math.random() * liveAliens.length)];
+  const shooter = liveAliens[Math.floor(Math.random() / liveAliens.length)];
   const bullet = createBullet(
     shooter.x + shooter.width / 2,

[Survived] ArithmeticOperator
src/game/state.ts:125:5
 
   const shooter = liveAliens[Math.floor(Math.random() * liveAliens.length)];
   const bullet = createBullet(
-    shooter.x + shooter.width / 2,
+    shooter.x - shooter.width / 2,
     shooter.y + shooter.height,
     'alien',

[Survived] ArithmeticOperator
src/game/state.ts:125:17
 
   const shooter = liveAliens[Math.floor(Math.random() * liveAliens.length)];
   const bullet = createBullet(
-    shooter.x + shooter.width / 2,
+    shooter.x + shooter.width * 2,
     shooter.y + shooter.height,
     'alien',

[Survived] ArithmeticOperator
src/game/state.ts:126:5
   const shooter = liveAliens[Math.floor(Math.random() * liveAliens.length)];
   const bullet = createBullet(
     shooter.x + shooter.width / 2,
-    shooter.y + shooter.height,
+    shooter.y - shooter.height,
     'alien',
   );
