[Killed] LogicalOperator
src/game/collision.ts:10:5
 
 export function rectsOverlap(a: Rect, b: Rect): boolean {
   return (
-    a.x < b.x + b.width &&
-    a.x + a.width > b.x &&
-    a.y < b.y + b.height &&
-    a.y + a.height > b.y
+    a.x < b.x + b.width && a.x + a.width > b.x && a.y < b.y + b.height || a.y + a.height > b.y
   );
 }
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/game/collision.ts:10:11
 
 export function rectsOverlap(a: Rect, b: Rect): boolean {
   return (
-    a.x < b.x + b.width &&
+    a.x < b.x - b.width &&
     a.x + a.width > b.x &&
     a.y < b.y + b.height &&
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/game/collision.ts:11:5
 export function rectsOverlap(a: Rect, b: Rect): boolean {
   return (
     a.x < b.x + b.width &&
-    a.x + a.width > b.x &&
+    true &&
     a.y < b.y + b.height &&
     a.y + a.height > b.y
killedBy: rectsOverlap should return false when edges exactly touch
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/collision.ts:11:5
 export function rectsOverlap(a: Rect, b: Rect): boolean {
   return (
     a.x < b.x + b.width &&
-    a.x + a.width > b.x &&
+    a.x + a.width >= b.x &&
     a.y < b.y + b.height &&
     a.y + a.height > b.y
killedBy: rectsOverlap should return false when edges exactly touch
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/game/collision.ts:12:11
   return (
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
-    a.y < b.y + b.height &&
+    a.y < b.y - b.height &&
     a.y + a.height > b.y
   );
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/game/collision.ts:12:5
   return (
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
-    a.y < b.y + b.height &&
+    true &&
     a.y + a.height > b.y
   );
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] EqualityOperator
src/game/collision.ts:13:5
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
     a.y < b.y + b.height &&
-    a.y + a.height > b.y
+    a.y + a.height <= b.y
   );
 }
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/game/collision.ts:13:5
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
     a.y < b.y + b.height &&
-    a.y + a.height > b.y
+    a.y - a.height > b.y
   );
 }
killedBy: rectsOverlap should detect overlapping rects
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/collision.ts:22:33
   targets: (Rect & { alive?: boolean })[],
 ): Hit[] {
   const hits: Hit[] = [];
-  for (const bullet of bullets) {
-    for (const target of targets) {
-      if (target.alive === false) continue;
-      if (rectsOverlap(bullet, target)) {
-        hits.push({ bullet, target });
-        break;
-      }
-    }
-  }
+  for (const bullet of bullets) {}
   return hits;
 }
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/game/collision.ts:23:35
 ): Hit[] {
   const hits: Hit[] = [];
   for (const bullet of bullets) {
-    for (const target of targets) {
-      if (target.alive === false) continue;
-      if (rectsOverlap(bullet, target)) {
-        hits.push({ bullet, target });
-        break;
-      }
-    }
+    for (const target of targets) {}
   }
   return hits;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/collision.ts:24:11
   const hits: Hit[] = [];
   for (const bullet of bullets) {
     for (const target of targets) {
-      if (target.alive === false) continue;
+      if (target.alive !== false) continue;
       if (rectsOverlap(bullet, target)) {
         hits.push({ bullet, target });
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/game/collision.ts:24:28
   const hits: Hit[] = [];
   for (const bullet of bullets) {
     for (const target of targets) {
-      if (target.alive === false) continue;
+      if (target.alive === true) continue;
       if (rectsOverlap(bullet, target)) {
         hits.push({ bullet, target });
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/game/collision.ts:25:11
   for (const bullet of bullets) {
     for (const target of targets) {
       if (target.alive === false) continue;
-      if (rectsOverlap(bullet, target)) {
+      if (false) {
         hits.push({ bullet, target });
         break;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/game/collision.ts:25:11
   for (const bullet of bullets) {
     for (const target of targets) {
       if (target.alive === false) continue;
-      if (rectsOverlap(bullet, target)) {
+      if (true) {
         hits.push({ bullet, target });
         break;
killedBy: checkBulletHits should return no hits when bullet misses
statusReason: expected [ { …(2) } ] to have a length of +0 but got 1
