[Killed] BooleanLiteral
src/game/entities.ts:42:62
 }
 
 export function createAlien(x: number, y: number, type: AlienType, points: number): Alien {
-  return { x, y, width: 40, height: 30, type, points, alive: true };
+  return { x, y, width: 40, height: 30, type, points, alive: false };
 }
 
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] UnaryOperator
src/game/entities.ts:46:35
 }
 
 export function createBullet(x: number, y: number, owner: BulletOwner): Bullet {
-  const vy = owner === 'player' ? -400 : 200;
+  const vy = owner === 'player' ? +400 : 200;
   return { x, y, width: 3, height: 10, vy, owner };
 }
killedBy: update should move bullets each tick
statusReason: expected 563.3333333333333 to be less than 556.6666666666666

[Killed] ConditionalExpression
src/game/entities.ts:46:14
 }
 
 export function createBullet(x: number, y: number, owner: BulletOwner): Bullet {
-  const vy = owner === 'player' ? -400 : 200;
+  const vy = false ? -400 : 200;
   return { x, y, width: 3, height: 10, vy, owner };
 }
killedBy: update should move bullets each tick
statusReason: expected 556.6666666666667 to be less than 553.3333333333334

[Killed] BlockStatement
src/game/entities.ts:58:40
   const segments: ShieldSegment[] = [];
   const cols = 5;
   const rows = 3;
-  for (let row = 0; row < rows; row++) {
-    for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
-    }
-  }
+  for (let row = 0; row < rows; row++) {}
   return { x, y, segments };
 }
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] EqualityOperator
src/game/entities.ts:58:21
   const segments: ShieldSegment[] = [];
   const cols = 5;
   const rows = 3;
-  for (let row = 0; row < rows; row++) {
+  for (let row = 0; row >= rows; row++) {
     for (let col = 0; col < cols; col++) {
       segments.push(createShieldSegment(x + col * 10, y + row * 10));
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] BlockStatement
src/game/entities.ts:59:42
   const cols = 5;
   const rows = 3;
   for (let row = 0; row < rows; row++) {
-    for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
-    }
+    for (let col = 0; col < cols; col++) {}
   }
   return { x, y, segments };
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ConditionalExpression
src/game/entities.ts:59:23
   const cols = 5;
   const rows = 3;
   for (let row = 0; row < rows; row++) {
-    for (let col = 0; col < cols; col++) {
+    for (let col = 0; false; col++) {
       segments.push(createShieldSegment(x + col * 10, y + row * 10));
     }
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArithmeticOperator
src/game/entities.ts:60:41
   const rows = 3;
   for (let row = 0; row < rows; row++) {
     for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
+      segments.push(createShieldSegment(x - col * 10, y + row * 10));
     }
   }
killedBy: Shield should position segments relative to shield origin
statusReason: expected 90 to be greater than or equal to 100

[Killed] ArithmeticOperator
src/game/entities.ts:60:55
   const rows = 3;
   for (let row = 0; row < rows; row++) {
     for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
+      segments.push(createShieldSegment(x + col * 10, y - row * 10));
     }
   }
killedBy: Shield should position segments relative to shield origin
statusReason: expected 470 to be greater than or equal to 480
