[Killed] ConditionalExpression
src/game/update.ts:13:7
 }
 
 export function update(state: GameState, dt: number, actions: Actions): GameState {
-  if (state.gameOver || state.won) return state;
+  if (true) return state;
 
   // 1. Player movement
killedBy: update should move player left when left action is active
statusReason: expected 375 to be less than 375

[Killed] LogicalOperator
src/game/update.ts:13:7
 }
 
 export function update(state: GameState, dt: number, actions: Actions): GameState {
-  if (state.gameOver || state.won) return state;
+  if (state.gameOver && state.won) return state;
 
   // 1. Player movement
killedBy: update should not update when game is over
statusReason: expected { …(8) } to be { …(8) } // Object.is equality

[Killed] BlockStatement
src/game/update.ts:20:22
   let next = movePlayer(state, direction, dt);
 
   // 2. Shoot
-  if (actions.shoot) {
-    next = playerShoot(next);
-  }
+  if (actions.shoot) {}
 
   // 3. Move bullets
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:20:7
   let next = movePlayer(state, direction, dt);
 
   // 2. Shoot
-  if (actions.shoot) {
+  if (false) {
     next = playerShoot(next);
   }
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/game/update.ts:31:45
   next = moveAliens(next, dt);
 
   // 5. Collisions: player bullets vs aliens
-  const playerBullets = next.bullets.filter(b => b.owner === 'player');
+  const playerBullets = next.bullets.filter(() => undefined);
   const alienHits = checkBulletHits(playerBullets, next.aliens.filter(a => a.alive));
   const hitBullets = new Set<Bullet>(alienHits.map(h => h.bullet));
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/update.ts:31:50
   next = moveAliens(next, dt);
 
   // 5. Collisions: player bullets vs aliens
-  const playerBullets = next.bullets.filter(b => b.owner === 'player');
+  const playerBullets = next.bullets.filter(b => b.owner !== 'player');
   const alienHits = checkBulletHits(playerBullets, next.aliens.filter(a => a.alive));
   const hitBullets = new Set<Bullet>(alienHits.map(h => h.bullet));
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/game/update.ts:32:71
 
   // 5. Collisions: player bullets vs aliens
   const playerBullets = next.bullets.filter(b => b.owner === 'player');
-  const alienHits = checkBulletHits(playerBullets, next.aliens.filter(a => a.alive));
+  const alienHits = checkBulletHits(playerBullets, next.aliens.filter(() => undefined));
   const hitBullets = new Set<Bullet>(alienHits.map(h => h.bullet));
   let score = next.score;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Survived] MethodExpression
src/game/update.ts:32:52
 
   // 5. Collisions: player bullets vs aliens
   const playerBullets = next.bullets.filter(b => b.owner === 'player');
-  const alienHits = checkBulletHits(playerBullets, next.aliens.filter(a => a.alive));
+  const alienHits = checkBulletHits(playerBullets, next.aliens);
   const hitBullets = new Set<Bullet>(alienHits.map(h => h.bullet));
   let score = next.score;

[Killed] EqualityOperator
src/game/update.ts:37:37
   let score = next.score;
 
   const newAliens = next.aliens.map(a => {
-    const hit = alienHits.find(h => h.target === a);
+    const hit = alienHits.find(h => h.target !== a);
     if (hit) {
       score += a.points;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/game/update.ts:37:32
   let score = next.score;
 
   const newAliens = next.aliens.map(a => {
-    const hit = alienHits.find(h => h.target === a);
+    const hit = alienHits.find(() => undefined);
     if (hit) {
       score += a.points;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/game/update.ts:38:14
 
   const newAliens = next.aliens.map(a => {
     const hit = alienHits.find(h => h.target === a);
-    if (hit) {
-      score += a.points;
-      return { ...a, alive: false };
-    }
+    if (hit) {}
     return a;
   });
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:38:9
 
   const newAliens = next.aliens.map(a => {
     const hit = alienHits.find(h => h.target === a);
-    if (hit) {
+    if (false) {
       score += a.points;
       return { ...a, alive: false };
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
src/game/update.ts:39:7
   const newAliens = next.aliens.map(a => {
     const hit = alienHits.find(h => h.target === a);
     if (hit) {
-      score += a.points;
+      score -= a.points;
       return { ...a, alive: false };
     }
killedBy: update should kill alien and add score on hit
statusReason: expected -30 to be 30 // Object.is equality

[Killed] BooleanLiteral
src/game/update.ts:40:29
     const hit = alienHits.find(h => h.target === a);
     if (hit) {
       score += a.points;
-      return { ...a, alive: false };
+      return { ...a, alive: true };
     }
     return a;
killedBy: update should kill alien and add score on hit
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/game/update.ts:46:24
   });
 
   // 6. Collisions: alien bullets vs player
-  const alienBullets = next.bullets.filter(b => b.owner === 'alien');
+  const alienBullets = next.bullets;
   const playerHits = checkBulletHits(alienBullets, [next.player]);
   let lives = next.player.lives;
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:46:49
   });
 
   // 6. Collisions: alien bullets vs player
-  const alienBullets = next.bullets.filter(b => b.owner === 'alien');
+  const alienBullets = next.bullets.filter(b => true);
   const playerHits = checkBulletHits(alienBullets, [next.player]);
   let lives = next.player.lives;
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/game/update.ts:49:33
   const alienBullets = next.bullets.filter(b => b.owner === 'alien');
   const playerHits = checkBulletHits(alienBullets, [next.player]);
   let lives = next.player.lives;
-  for (const hit of playerHits) {
-    lives--;
-    hitBullets.add(hit.bullet);
-  }
+  for (const hit of playerHits) {}
 
   // 7. Collisions: all bullets vs shields
killedBy: update should lose a life when alien bullet hits player
statusReason: expected 3 to be 2 // Object.is equality

[Killed] UpdateOperator
src/game/update.ts:50:5
   const playerHits = checkBulletHits(alienBullets, [next.player]);
   let lives = next.player.lives;
   for (const hit of playerHits) {
-    lives--;
+    lives++;
     hitBullets.add(hit.bullet);
   }
killedBy: update should lose a life when alien bullet hits player
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ArrowFunction
src/game/update.ts:55:48
   }
 
   // 7. Collisions: all bullets vs shields
-  const remainingBullets = next.bullets.filter(b => !hitBullets.has(b));
+  const remainingBullets = next.bullets.filter(() => undefined);
   const newShields = next.shields.map(shield => {
     const newSegments = shield.segments
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/game/update.ts:55:53
   }
 
   // 7. Collisions: all bullets vs shields
-  const remainingBullets = next.bullets.filter(b => !hitBullets.has(b));
+  const remainingBullets = next.bullets.filter(b => hitBullets.has(b));
   const newShields = next.shields.map(shield => {
     const newSegments = shield.segments
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] MethodExpression
src/game/update.ts:57:25
   // 7. Collisions: all bullets vs shields
   const remainingBullets = next.bullets.filter(b => !hitBullets.has(b));
   const newShields = next.shields.map(shield => {
-    const newSegments = shield.segments
-      .map(seg => {
-        for (const bullet of remainingBullets) {
-          if (rectsOverlap(bullet, seg)) {
-            hitBullets.add(bullet);
-            return { ...seg, health: seg.health - 1 };
-          }
-        }
-        return seg;
-      })
-      .filter(seg => seg.health > 0);
+    const newSegments = shield.segments.map(seg => {
+  for (const bullet of remainingBullets) {
+    if (rectsOverlap(bullet, seg)) {
+      hitBullets.add(bullet);
+      return {
+        ...seg,
+        health: seg.health - 1
+      };
+    }
+  }
+  return seg;
+});
     return { ...shield, segments: newSegments };
   });
killedBy: update should remove shield segment when health reaches 0
statusReason: expected [ { x: 150, y: 480, width: 10, …(2) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/game/update.ts:59:48
   const newShields = next.shields.map(shield => {
     const newSegments = shield.segments
       .map(seg => {
-        for (const bullet of remainingBullets) {
-          if (rectsOverlap(bullet, seg)) {
-            hitBullets.add(bullet);
-            return { ...seg, health: seg.health - 1 };
-          }
-        }
+        for (const bullet of remainingBullets) {}
         return seg;
       })
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
src/game/update.ts:60:42
     const newSegments = shield.segments
       .map(seg => {
         for (const bullet of remainingBullets) {
-          if (rectsOverlap(bullet, seg)) {
-            hitBullets.add(bullet);
-            return { ...seg, health: seg.health - 1 };
-          }
+          if (rectsOverlap(bullet, seg)) {}
         }
         return seg;
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:60:15
     const newSegments = shield.segments
       .map(seg => {
         for (const bullet of remainingBullets) {
-          if (rectsOverlap(bullet, seg)) {
+          if (false) {
             hitBullets.add(bullet);
             return { ...seg, health: seg.health - 1 };
killedBy: update should damage shield segment on bullet hit
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/game/update.ts:62:38
         for (const bullet of remainingBullets) {
           if (rectsOverlap(bullet, seg)) {
             hitBullets.add(bullet);
-            return { ...seg, health: seg.health - 1 };
+            return { ...seg, health: seg.health + 1 };
           }
         }
killedBy: update should damage shield segment on bullet hit
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:67:22
         }
         return seg;
       })
-      .filter(seg => seg.health > 0);
+      .filter(seg => false);
     return { ...shield, segments: newSegments };
   });
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'health')

[Killed] EqualityOperator
src/game/update.ts:67:22
         }
         return seg;
       })
-      .filter(seg => seg.health > 0);
+      .filter(seg => seg.health <= 0);
     return { ...shield, segments: newSegments };
   });
killedBy: update should damage shield segment on bullet hit
statusReason: Cannot read properties of undefined (reading 'health')

[Killed] BooleanLiteral
src/game/update.ts:72:49
   });
 
   // 8. Remove hit bullets
-  const finalBullets = next.bullets.filter(b => !hitBullets.has(b));
+  const finalBullets = next.bullets.filter(b => hitBullets.has(b));
 
   // 9. Win/Lose conditions
killedBy: update should create bullet on shoot action
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/game/update.ts:72:24
   });
 
   // 8. Remove hit bullets
-  const finalBullets = next.bullets.filter(b => !hitBullets.has(b));
+  const finalBullets = next.bullets;
 
   // 9. Win/Lose conditions
killedBy: update should remove player bullet on alien hit
statusReason: expected [ { x: 81, y: 61, width: 3, …(3) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/game/update.ts:75:40
   const finalBullets = next.bullets.filter(b => !hitBullets.has(b));
 
   // 9. Win/Lose conditions
-  const allDead = newAliens.every(a => !a.alive);
+  const allDead = newAliens.every(a => a.alive);
   const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
   const gameOver = lives <= 0 || aliensReachedPlayer;
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ArrowFunction
src/game/update.ts:75:35
   const finalBullets = next.bullets.filter(b => !hitBullets.has(b));
 
   // 9. Win/Lose conditions
-  const allDead = newAliens.every(a => !a.alive);
+  const allDead = newAliens.every(() => undefined);
   const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
   const gameOver = lives <= 0 || aliensReachedPlayer;
killedBy: update should set won when all aliens are dead
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/update.ts:76:62
 
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
-  const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
+  const aliensReachedPlayer = newAliens.some(a => a.alive && a.y < next.player.y);
   const gameOver = lives <= 0 || aliensReachedPlayer;
 
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ConditionalExpression
src/game/update.ts:76:51
 
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
-  const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
+  const aliensReachedPlayer = newAliens.some(a => true);
   const gameOver = lives <= 0 || aliensReachedPlayer;
 
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ConditionalExpression
src/game/update.ts:77:20
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
   const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
-  const gameOver = lives <= 0 || aliensReachedPlayer;
+  const gameOver = true;
 
   return {
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] EqualityOperator
src/game/update.ts:77:20
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
   const aliensReachedPlayer = newAliens.some(a => a.alive && a.y >= next.player.y);
-  const gameOver = lives <= 0 || aliensReachedPlayer;
+  const gameOver = lives > 0 || aliensReachedPlayer;
 
   return {
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334
