[Killed] BooleanLiteral
src/input/input.ts:10:66
 };
 
 export class InputHandler {
-  private pressed: Actions = { left: false, right: false, shoot: false };
+  private pressed: Actions = { left: false, right: false, shoot: true };
 
   handleKeyDown(key: string): void {
killedBy: InputHandler should start with no actions active
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/input/input.ts:10:38
 };
 
 export class InputHandler {
-  private pressed: Actions = { left: false, right: false, shoot: false };
+  private pressed: Actions = { left: true, right: false, shoot: false };
 
   handleKeyDown(key: string): void {
killedBy: InputHandler should start with no actions active
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/input/input.ts:12:36
 export class InputHandler {
   private pressed: Actions = { left: false, right: false, shoot: false };
 
-  handleKeyDown(key: string): void {
-    const action = KEY_MAP[key];
-    if (action) this.pressed[action] = true;
-  }
+  handleKeyDown(key: string): void {}
 
   handleKeyUp(key: string): void {
killedBy: InputHandler should set left on ArrowLeft keydown
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/input/input.ts:14:9
 
   handleKeyDown(key: string): void {
     const action = KEY_MAP[key];
-    if (action) this.pressed[action] = true;
+    if (false) this.pressed[action] = true;
   }
 
killedBy: InputHandler should set left on ArrowLeft keydown
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/input/input.ts:14:40
 
   handleKeyDown(key: string): void {
     const action = KEY_MAP[key];
-    if (action) this.pressed[action] = true;
+    if (action) this.pressed[action] = false;
   }
 
killedBy: InputHandler should set left on ArrowLeft keydown
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/input/input.ts:17:34
     if (action) this.pressed[action] = true;
   }
 
-  handleKeyUp(key: string): void {
-    const action = KEY_MAP[key];
-    if (action) this.pressed[action] = false;
-  }
+  handleKeyUp(key: string): void {}
 
   getActions(): Actions {
killedBy: InputHandler should clear left on ArrowLeft keyup
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/input/input.ts:19:9
 
   handleKeyUp(key: string): void {
     const action = KEY_MAP[key];
-    if (action) this.pressed[action] = false;
+    if (false) this.pressed[action] = false;
   }
 
killedBy: InputHandler should clear left on ArrowLeft keyup
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/input/input.ts:19:40
 
   handleKeyUp(key: string): void {
     const action = KEY_MAP[key];
-    if (action) this.pressed[action] = false;
+    if (action) this.pressed[action] = true;
   }
 
killedBy: InputHandler should clear left on ArrowLeft keyup
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/input/input.ts:26:35
     return { ...this.pressed };
   }
 
-  bind(target: EventTarget): void {
-    target.addEventListener('keydown', (e) => this.handleKeyDown((e as KeyboardEvent).key));
-    target.addEventListener('keyup', (e) => this.handleKeyUp((e as KeyboardEvent).key));
-  }
+  bind(target: EventTarget): void {}
 }
 
killedBy: InputHandler should bind to an EventTarget and respond to events
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/input/input.ts:27:40
   }
 
   bind(target: EventTarget): void {
-    target.addEventListener('keydown', (e) => this.handleKeyDown((e as KeyboardEvent).key));
+    target.addEventListener('keydown', () => undefined);
     target.addEventListener('keyup', (e) => this.handleKeyUp((e as KeyboardEvent).key));
   }
killedBy: InputHandler should bind to an EventTarget and respond to events
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/input/input.ts:28:38
 
   bind(target: EventTarget): void {
     target.addEventListener('keydown', (e) => this.handleKeyDown((e as KeyboardEvent).key));
-    target.addEventListener('keyup', (e) => this.handleKeyUp((e as KeyboardEvent).key));
+    target.addEventListener('keyup', () => undefined);
   }
 }
killedBy: InputHandler should bind to an EventTarget and respond to events
statusReason: expected true to be false // Object.is equality
