[Killed] ArrayDeclaration
src/game/state.ts:49:55
 
 function createAlienGrid(): Alien[] {
   const aliens: Alien[] = [];
-  const rows: { type: AlienType; points: number }[] = [
-    { type: 'top', points: 30 },
-    { type: 'middle', points: 20 },
-    { type: 'middle', points: 20 },
-    { type: 'bottom', points: 10 },
-    { type: 'bottom', points: 10 },
-  ];
+  const rows: { type: AlienType; points: number }[] = [];
 
   for (let row = 0; row < rows.length; row++) {
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] EqualityOperator
src/game/state.ts:57:21
     { type: 'bottom', points: 10 },
   ];
 
-  for (let row = 0; row < rows.length; row++) {
+  for (let row = 0; row >= rows.length; row++) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
killedBy: render should draw far fewer rects when all aliens dead
statusReason: expected 117 to be less than 117

[Killed] EqualityOperator
src/game/state.ts:57:21
     { type: 'bottom', points: 10 },
   ];
 
-  for (let row = 0; row < rows.length; row++) {
+  for (let row = 0; row <= rows.length; row++) {
     for (let col = 0; col < 11; col++) {
       const x = 80 + col * 55;
killedBy: update should move player left when left action is active
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
src/game/state.ts:58:23
   ];
 
   for (let row = 0; row < rows.length; row++) {
-    for (let col = 0; col < 11; col++) {
+    for (let col = 0; col >= 11; col++) {
       const x = 80 + col * 55;
       const y = 60 + row * 45;
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] EqualityOperator
src/game/state.ts:70:15
 export function movePlayer(state: GameState, direction: Direction, dt: number): GameState {
   if (direction === 'none') return state;
 
-  const dir = direction === 'left' ? -1 : 1;
+  const dir = direction !== 'left' ? -1 : 1;
   let newX = state.player.x + dir * PLAYER_SPEED * dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
killedBy: update should move player left when left action is active
statusReason: expected 380 to be less than 375

[Killed] ArithmeticOperator
src/game/state.ts:71:31
   if (direction === 'none') return state;
 
   const dir = direction === 'left' ? -1 : 1;
-  let newX = state.player.x + dir * PLAYER_SPEED * dt;
+  let newX = state.player.x + dir * PLAYER_SPEED / dt;
   newX = Math.max(0, Math.min(GAME_WIDTH - state.player.width, newX));
 
killedBy: movePlayer should move player left by exactly PLAYER_SPEED * dt
statusReason: expected +0 to be close to 370, received difference is 370, but expected 0.000005

[Killed] ConditionalExpression
src/game/state.ts:78:51
 }
 
 export function playerShoot(state: GameState): GameState {
-  const hasPlayerBullet = state.bullets.some(b => b.owner === 'player');
+  const hasPlayerBullet = state.bullets.some(b => true);
   if (hasPlayerBullet) return state;
 
killedBy: playerShoot should allow shooting when only alien bullets exist
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArithmeticOperator
src/game/state.ts:93:17
   const liveAliens = state.aliens.filter(a => a.alive);
   if (liveAliens.length === 0) return state;
 
-  const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 4 + state.elapsed * 2;
+  const speed = ALIEN_SPEED_BASE - (55 - liveAliens.length) * 4 + state.elapsed * 2;
   let direction = state.alienDirection;
 
killedBy: moveAliens should increase speed by kills*4
statusReason: expected 77.33333333333333 to be close to 83.33333333333333, received difference is 6, but expected 0.000005

[Killed] ArithmeticOperator
src/game/state.ts:93:17
   const liveAliens = state.aliens.filter(a => a.alive);
   if (liveAliens.length === 0) return state;
 
-  const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 4 + state.elapsed * 2;
+  const speed = ALIEN_SPEED_BASE + (55 - liveAliens.length) * 4 - state.elapsed * 2;
   let direction = state.alienDirection;
 
killedBy: moveAliens should increase speed by elapsed*2
statusReason: expected 80 to be close to 80.66666666666667, received difference is 0.6666666666666714, but expected 0.000005

[Killed] ArithmeticOperator
src/game/state.ts:98:49
 
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
+    if (direction === 1) return a.x + a.width + speed / dt >= GAME_WIDTH;
     return a.x - speed * dt <= 0;
   });
killedBy: moveAliens should move aliens to the right when direction is 1
statusReason: expected 80 to be greater than 80

[Killed] EqualityOperator
src/game/state.ts:98:9
 
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
-    if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
+    if (direction !== 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
     return a.x - speed * dt <= 0;
   });
killedBy: moveAliens should move aliens to the left when direction is -1
statusReason: expected 280 to be less than 280

[Killed] ConditionalExpression
src/game/state.ts:99:12
   // Check if any alive alien hits the edge
   const hitsEdge = liveAliens.some(a => {
     if (direction === 1) return a.x + a.width + speed * dt >= GAME_WIDTH;
-    return a.x - speed * dt <= 0;
+    return true;
   });
 
killedBy: moveAliens should move aliens to the left when direction is -1
statusReason: expected 280 to be less than 280

[Killed] ConditionalExpression
src/game/state.ts:102:7
     return a.x - speed * dt <= 0;
   });
 
-  if (hitsEdge) {
+  if (true) {
     // Step down and reverse
     const newAliens = state.aliens.map(a => ({ ...a, y: a.y + ALIEN_STEP_DOWN }));
killedBy: moveAliens should move aliens to the right when direction is 1
statusReason: expected 80 to be greater than 80

[Killed] ArrowFunction
src/game/state.ts:117:13
 export function moveBullets(state: GameState, dt: number): GameState {
   const newBullets = state.bullets
     .map(b => ({ ...b, y: b.y + b.vy * dt }))
-    .filter(b => b.y + b.height > 0 && b.y < GAME_HEIGHT);
+    .filter(() => undefined);
   return { ...state, bullets: newBullets };
 }
killedBy: moveBullets should move bullets by exactly vy * dt
statusReason: Cannot read properties of undefined (reading 'y')
