[Killed] EqualityOperator
src/game/collision.ts:12:5
   return (
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
-    a.y < b.y + b.height &&
+    a.y <= b.y + b.height &&
     a.y + a.height > b.y
   );
killedBy: rectsOverlap should return false when a.y exactly equals b.y + b.height
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/collision.ts:13:5
     a.x < b.x + b.width &&
     a.x + a.width > b.x &&
     a.y < b.y + b.height &&
-    a.y + a.height > b.y
+    a.y + a.height >= b.y
   );
 }
killedBy: rectsOverlap should return false when edges exactly touch vertically
statusReason: expected true to be false // Object.is equality
