[Killed] EqualityOperator
src/game/entities.ts:58:21
   const segments: ShieldSegment[] = [];
   const cols = 5;
   const rows = 3;
-  for (let row = 0; row < rows; row++) {
+  for (let row = 0; row <= rows; row++) {
     for (let col = 0; col < cols; col++) {
       segments.push(createShieldSegment(x + col * 10, y + row * 10));
killedBy: Shield should create a shield with exactly 5x3 = 15 segments
statusReason: expected [ { x: 100, y: 480, …(3) }, …(19) ] to have a length of 15 but got 20

[Killed] EqualityOperator
src/game/entities.ts:59:23
   const cols = 5;
   const rows = 3;
   for (let row = 0; row < rows; row++) {
-    for (let col = 0; col < cols; col++) {
+    for (let col = 0; col <= cols; col++) {
       segments.push(createShieldSegment(x + col * 10, y + row * 10));
     }
killedBy: Shield should create a shield with exactly 5x3 = 15 segments
statusReason: expected [ { x: 100, y: 480, …(3) }, …(17) ] to have a length of 15 but got 18

[Killed] ArithmeticOperator
src/game/entities.ts:60:45
   const rows = 3;
   for (let row = 0; row < rows; row++) {
     for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
+      segments.push(createShieldSegment(x + col / 10, y + row * 10));
     }
   }
killedBy: Shield should position segments in a correct 5x3 grid
statusReason: expected 100.1 to be 110 // Object.is equality

[Killed] ArithmeticOperator
src/game/entities.ts:60:59
   const rows = 3;
   for (let row = 0; row < rows; row++) {
     for (let col = 0; col < cols; col++) {
-      segments.push(createShieldSegment(x + col * 10, y + row * 10));
+      segments.push(createShieldSegment(x + col * 10, y + row / 10));
     }
   }
killedBy: Shield should position segments in a correct 5x3 grid
statusReason: expected 480.1 to be 490 // Object.is equality
