[Killed] MethodExpression
src/game/update.ts:55:28
   }
 
   // 7. Collisions: all bullets vs shields
-  const remainingBullets = next.bullets.filter(b => !hitBullets.has(b));
+  const remainingBullets = next.bullets;
   const newShields = next.shields.map(shield => {
     const newSegments = shield.segments
killedBy: update should not let a bullet that hit an alien also hit a shield
statusReason: expected 2 to be 3 // Object.is equality

[Killed] MethodExpression
src/game/update.ts:75:19
   const finalBullets = next.bullets.filter(b => !hitBullets.has(b));
 
   // 9. Win/Lose conditions
-  const allDead = newAliens.every(a => !a.alive);
+  const allDead = newAliens.some(a => !a.alive);
   const allSegmentYs = newShields.flatMap(s => s.segments.map(seg => seg.y));
   const shieldTop = allSegmentYs.length > 0
killedBy: update should not set won when some aliens still alive
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/game/update.ts:77:21
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
   const allSegmentYs = newShields.flatMap(s => s.segments.map(seg => seg.y));
-  const shieldTop = allSegmentYs.length > 0
+  const shieldTop = allSegmentYs.length <= 0
     ? Math.min(...allSegmentYs)
     : next.player.y;
killedBy: update should set gameOver when aliens reach shield row
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/game/update.ts:77:21
   // 9. Win/Lose conditions
   const allDead = newAliens.every(a => !a.alive);
   const allSegmentYs = newShields.flatMap(s => s.segments.map(seg => seg.y));
-  const shieldTop = allSegmentYs.length > 0
+  const shieldTop = allSegmentYs.length >= 0
     ? Math.min(...allSegmentYs)
     : next.player.y;
killedBy: update should fall back to player.y when all shields destroyed
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/game/update.ts:78:7
   const allDead = newAliens.every(a => !a.alive);
   const allSegmentYs = newShields.flatMap(s => s.segments.map(seg => seg.y));
   const shieldTop = allSegmentYs.length > 0
-    ? Math.min(...allSegmentYs)
+    ? Math.max(...allSegmentYs)
     : next.player.y;
   const aliensReachedShields = newAliens.some(a => a.alive && a.y + a.height >= shieldTop);
killedBy: update should use topmost shield segment y for game over check
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:80:52
   const shieldTop = allSegmentYs.length > 0
     ? Math.min(...allSegmentYs)
     : next.player.y;
-  const aliensReachedShields = newAliens.some(a => a.alive && a.y + a.height >= shieldTop);
+  const aliensReachedShields = newAliens.some(a => false);
   const gameOver = lives <= 0 || aliensReachedShields;
 
killedBy: update should set gameOver when aliens reach shield row
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/game/update.ts:80:63
   const shieldTop = allSegmentYs.length > 0
     ? Math.min(...allSegmentYs)
     : next.player.y;
-  const aliensReachedShields = newAliens.some(a => a.alive && a.y + a.height >= shieldTop);
+  const aliensReachedShields = newAliens.some(a => a.alive && true);
   const gameOver = lives <= 0 || aliensReachedShields;
 
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ConditionalExpression
src/game/update.ts:81:20
     ? Math.min(...allSegmentYs)
     : next.player.y;
   const aliensReachedShields = newAliens.some(a => a.alive && a.y + a.height >= shieldTop);
-  const gameOver = lives <= 0 || aliensReachedShields;
+  const gameOver = true;
 
   return {
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] EqualityOperator
src/game/update.ts:81:20
     ? Math.min(...allSegmentYs)
     : next.player.y;
   const aliensReachedShields = newAliens.some(a => a.alive && a.y + a.height >= shieldTop);
-  const gameOver = lives <= 0 || aliensReachedShields;
+  const gameOver = lives > 0 || aliensReachedShields;
 
   return {
killedBy: update should move bullets each tick
statusReason: expected 543.3333333333334 to be less than 543.3333333333334

[Killed] ArithmeticOperator
src/game/update.ts:92:14
     player: { ...next.player, lives },
     gameOver,
     won: allDead,
-    elapsed: state.elapsed + dt,
+    elapsed: state.elapsed - dt,
   };
 }
killedBy: update should accumulate elapsed time
statusReason: expected -0.016666666666666666 to be close to 0.016666666666666666, received difference is 0.03333333333333333, but expected 0.000005
